{
  "_name_or_path": "t5_base",
  "adapter_dim": 384,
  "add_router_probs": false,
  "architectures": [
    "T5ForConditionalGenerationmoe"
  ],
  "num_share_experts": 0,
  "num_experts": 5,
  "my_hidden_size": 768,


  "d_ff": 3072,
  "d_kv": 64,
  "d_model": 768,
  "decoder_sparse_step": 4,
  "decoder_start_token_id": 0,
  "dense_act_fn": "relu",
  "dropout_rate": 0.1,
  "encoder_sparse_step": 4,
  "eos_token_id": 1,
  "expert_capacity": 64,
  "feed_forward_proj": "relu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": false,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 12,
  "num_heads": 12,
  "num_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "router_aux_loss_coef": 0.001,
  "router_bias": false,
  "router_dtype": "float32",
  "router_ignore_padding_tokens": false,
  "router_jitter_noise": 0.01,
  "router_type": "tokens_masked",
  "router_z_loss_coef": 0.001,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 2.0,
      "max_length": 200,
      "min_length": 30,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "summarize: "
    },
    "translation_en_to_de": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to German: "
    },
    "translation_en_to_fr": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to French: "
    },
    "translation_en_to_ro": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to Romanian: "
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.25.1",
  "use_cache": true,
  "vocab_size": 32128
}
